[
  {
    "objectID": "clients.html",
    "href": "clients.html",
    "title": "clients",
    "section": "",
    "text": "source\n\nfoo\n\n foo ()"
  },
  {
    "objectID": "api.html",
    "href": "api.html",
    "title": "api",
    "section": "",
    "text": "logging.basicConfig(level=logging.INFO)"
  },
  {
    "objectID": "api.html#list-workspaces",
    "href": "api.html#list-workspaces",
    "title": "api",
    "section": "List Workspaces",
    "text": "List Workspaces\nThe list_workspaces function retreives a list of workspaces from blob storage and returns it in various formats\n\n@memoize_stampede(cache, expire=60 * 60 * 3) # cache for 3 hours\ndef list_workspaces(fmt: str = \"df\", # df, csv, json, list\n                    agency: str = \"ALL\"): # Agency alias or ALL\n    path = datalake_path()\n    df = pandas.read_csv((path / \"notebooks/lists/SentinelWorkspaces.csv\").open())\n    df = df.join(pandas.read_csv((path / \"notebooks/lists/SecOps Groups.csv\").open()).set_index(\"Alias\"), on=\"SecOps Group\", rsuffix=\"_secops\")\n    df = df.rename(columns={\"SecOps Group\": \"alias\", \"Domains and IPs\": \"domains\"})\n    df = df.dropna(subset=[\"customerId\"]).sort_values(by=\"alias\").convert_dtypes().reset_index()\n    if agency != \"ALL\":\n        df = df[df[\"alias\"] == agency]\n    if fmt == \"df\":\n        return df\n    elif fmt == \"csv\":\n        return df.to_csv()\n    elif fmt == \"json\":\n        return df.fillna(\"\").to_dict(\"records\")\n    elif fmt == \"list\":\n        return list(df[\"customerId\"].unique())\n    else:\n        raise ValueError(\"Invalid format\")\n\n\nsource\n\nlist_workspaces\n\n list_workspaces (fmt:str='df', agency:str='ALL')\n\n\n\n\n\nType\nDefault\nDetails\n\n\n\n\nfmt\nstr\ndf\ndf, csv, json, list\n\n\nagency\nstr\nALL\nAgency alias or ALL\n\n\n\nYou can use it do lookup an agencies alias based on its customerId (also known as TenantId, Log Analytics WorkspaceId)\n\nworkspaces = list_workspaces()\nworkspaces.query(f'customerId == \"{workspaces[\"customerId\"][0]}\"')[\"alias\"].str.cat()"
  },
  {
    "objectID": "api.html#threat-hunting-helper",
    "href": "api.html#threat-hunting-helper",
    "title": "api",
    "section": "Threat hunting helper",
    "text": "Threat hunting helper\nScan across all databases and tables for columns with a given predicate\n\ncolumns_of_interest = benedict({\n    \"name\": ['AADEmail', 'AccountName', 'AccountUPN', 'AccountUpn', 'Account', 'CompromisedEntity', 'DestinationUserName', \n             \"Computer\", \"DisplayName\", \"EmailSenderAddress\", \"FileName\", 'FilePath', \"FolderPath\", 'FullyQualifiedSubjectUserName', 'InitiatingProcessAccountUpn',\n            'MailboxOwnerUPN', 'Name', 'NewProcessName', 'Owner', 'ParentProcessName', 'Process', 'CommandLine', 'ProcessCommandLine', 'RecipientEmailAddress',\n            'RequesterUpn', 'SenderMailFromAddress', 'SourceIdentity', 'SourceUserName', 'SubjectUserName', 'TargetUserName', 'TargetUser', 'Upn',\n            'UserName', 'userName', 'UserPrincipalName'],\n    \"guid\": ['Caller', \"DestinationUserID\", 'SourceUserID', 'UserId'],\n    \"ip\": ['CallerIpAddress', 'DestinationIP', 'DstIpAddr', 'EmailSourceIpAddress', 'IPAddresses', 'IPAddress', 'IpAddress',\n           'NetworkDestinationIP', 'NetworkIP', 'NetworkSourceIP', 'RemoteIP', 'SourceIP', 'SrcIpAddr'],\n    \"url\": [\"DomainName\", 'FileOriginUrl', 'FQDN', 'RemoteUrl', 'Url'],\n    \"hash\": [\"MD5\", \"SHA1\", \"SHA256\", 'FileHashValue', 'FileHash', 'InitiatingProcessSHA256']\n})\n\ncolumns = [column for area in columns_of_interest.values() for column in area]\n\ndef hunt(indicators, expression=\"has\", columns=columns, workspaces=None, timespans=[\"1d\", \"14d\", \"90d\", \"700d\"], take=5000):\n    queries = []\n    if workspaces is None:\n        workspaces = list_securityinsights()\n    else:\n        df = list_securityinsights()\n        workspaces = df[df[\"customerId\"].isin(workspaces)]\n    querylogged = False\n    for indicator in indicators:\n        if expression not in ['has_all']:\n            indicator = f\"'{indicator}'\" # wrap indicator in quotes unless expecting dynamic\n        if not querylogged:\n            logger.info(f\"Test Query: find where {columns[0]} {expression} {indicator} | take {take}\")\n            querylogged = True\n        for chunk in chunks([f\"{column} {expression} {indicator}\" for column in columns], 20):\n            query = \" or \".join(chunk)\n            query = f\"find where {query} | take {take} | extend placeholder_=dynamic({{'':null}}) | evaluate bag_unpack(column_ifexists('pack_', placeholder_))\"\n            queries.append(query)\n    for timespan in timespans:\n        results = pandas.concat(loganalytics_query(queries, pandas.Timedelta(timespan), sentinel_workspaces = workspaces).values())\n        if 'placeholder_' in results.columns:\n            results = results.drop('placeholder_', axis=1)\n        if results.empty:\n            logger.info(f\"No results in {timespan}, extending hunt\")\n            continue\n        logger.info(f\"Found {indicators} in {timespan}, returning\")\n        return results\n    else:\n        raise Exception(\"No results found!\")\n\n\nsource\n\nhunt\n\n hunt (indicators, expression='has', columns=['AADEmail', 'AccountName',\n       'AccountUPN', 'AccountUpn', 'Account', 'CompromisedEntity',\n       'DestinationUserName', 'Computer', 'DisplayName',\n       'EmailSenderAddress', 'FileName', 'FilePath', 'FolderPath',\n       'FullyQualifiedSubjectUserName', 'InitiatingProcessAccountUpn',\n       'MailboxOwnerUPN', 'Name', 'NewProcessName', 'Owner',\n       'ParentProcessName', 'Process', 'CommandLine',\n       'ProcessCommandLine', 'RecipientEmailAddress', 'RequesterUpn',\n       'SenderMailFromAddress', 'SourceIdentity', 'SourceUserName',\n       'SubjectUserName', 'TargetUserName', 'TargetUser', 'Upn',\n       'UserName', 'userName', 'UserPrincipalName', 'Caller',\n       'DestinationUserID', 'SourceUserID', 'UserId', 'CallerIpAddress',\n       'DestinationIP', 'DstIpAddr', 'EmailSourceIpAddress',\n       'IPAddresses', 'IPAddress', 'IpAddress', 'NetworkDestinationIP',\n       'NetworkIP', 'NetworkSourceIP', 'RemoteIP', 'SourceIP',\n       'SrcIpAddr', 'DomainName', 'FileOriginUrl', 'FQDN', 'RemoteUrl',\n       'Url', 'MD5', 'SHA1', 'SHA256', 'FileHashValue', 'FileHash',\n       'InitiatingProcessSHA256'], workspaces=None, timespans=['1d',\n       '14d', '90d', '700d'], take=5000)\n\n\nhunt(['(\"ntdsutil\", \"ifm\")'], expression=\"has_all\", columns=[\"InitiatingProcessCommandLine\", \"ProcessCommandLine\", \"CommandLine\"], timespans=[\"90d\"])\n\n\ndef atlaskit_transformer(inputtext, inputfmt=\"md\", outputfmt=\"wiki\", runtime=\"node\"):\n    import nbdev_squ\n    transformer = dirs.user_cache_path / f\"atlaskit-transformer.bundle_v{nbdev_squ.__version__}.js\"\n    if not transformer.exists():\n        transformer_url = f'{nbdev_squ._modidx.d[\"settings\"][\"git_url\"]}/releases/download/v{nbdev_squ.__version__}/atlaskit-transformer.bundle.js'\n        transformer.write_bytes(requests.get(transformer_url).content)\n    cmd = [runtime, str(transformer), inputfmt, outputfmt]\n    logger.debug(\" \".join(cmd))\n    try:\n        return run(cmd, input=inputtext, text=True, capture_output=True, check=True).stdout\n    except CalledProcessError:\n        run(cmd, input=inputtext, text=True, check=True)\n\n\nsource\n\n\natlaskit_transformer\n\n atlaskit_transformer (inputtext, inputfmt='md', outputfmt='wiki',\n                       runtime='node')\n\n\nprint(atlaskit_transformer(\"\"\"# Heading 1\n\n- a bullet\n[a link](https://github.com]\n\"\"\"))"
  },
  {
    "objectID": "api.html#sentinel-incident-sync-helpers",
    "href": "api.html#sentinel-incident-sync-helpers",
    "title": "api",
    "section": "Sentinel Incident sync helpers",
    "text": "Sentinel Incident sync helpers\nOverall process below will be to grab all the incidents from Sentinel, and save them into individual files per day based on their last updated time. A subsequent process can then load those files (e.g. ingest into ADX) and/or synchronise the updates into Jira.\n\ndef security_incidents(start=pandas.Timestamp(\"now\", tz=\"UTC\") - pandas.Timedelta(\"1d\"), timedelta=pandas.Timedelta(\"1d\")):\n    # Queries for security incidents from `start` time for `timedelta` and returns a dataframe\n    # Sorts by TimeGenerated (TODO)\n    query = \"SecurityIncident | summarize arg_max(TimeGenerated, *) by IncidentNumber\"\n    return query_all(query, timespan=(start.to_pydatetime(), timedelta))\n\ndef security_alerts(start=pandas.Timestamp(\"now\", tz=\"UTC\") - pandas.Timedelta(\"1d\"), timedelta=pandas.Timedelta(\"1d\")):\n    # Queries for security alerts from `start` time for `timedelta` and returns a dataframe\n    # Sorts by TimeGenerated (TODO)\n    query = \"SecurityAlert | summarize arg_max(TimeGenerated, *) by SystemAlertId\"\n    return query_all(query, timespan=(start.to_pydatetime(), timedelta))\n\n\nsource\n\nsecurity_alerts\n\n security_alerts (start=Timestamp('2023-05-24 00:09:41.965365+0000',\n                  tz='UTC'), timedelta=Timedelta('1 days 00:00:00'))\n\n\nsource\n\n\nsecurity_incidents\n\n security_incidents (start=Timestamp('2023-05-24 00:09:41.965132+0000',\n                     tz='UTC'), timedelta=Timedelta('1 days 00:00:00'))\n\n\ndf = security_incidents(start=pandas.Timestamp(\"now\", tz=\"UTC\") - pandas.Timedelta(\"14d\"), timedelta=pandas.Timedelta(\"14d\"))"
  },
  {
    "objectID": "core.html",
    "href": "core.html",
    "title": "core",
    "section": "",
    "text": "logging.basicConfig(level=logging.INFO)"
  },
  {
    "objectID": "core.html#caching-and-retry-helpers",
    "href": "core.html#caching-and-retry-helpers",
    "title": "core",
    "section": "Caching and retry helpers",
    "text": "Caching and retry helpers\nThe below cache sets up a persistent per user disk cache (to ensure security) that can be used throughout api setup and configuration. retryer will try to run a function again up to 3 times with a random exponential backoff to handle upstream api exceptions.\n\ndirs = PlatformDirs(\"nbdev-squ\")\ncache = Cache(dirs.user_cache_dir)\nretryer = Retrying(wait=wait_random_exponential(), stop=stop_after_attempt(3), reraise=True)"
  },
  {
    "objectID": "core.html#login-and-secrets-management",
    "href": "core.html#login-and-secrets-management",
    "title": "core",
    "section": "Login and secrets management",
    "text": "Login and secrets management\nThe squ library depends on authentication configured and ready to go. There are 2 paths to login used based on environment variables available. Once logged in it will attempt to populate cache[\"config\"] with secrets from a configuration keyvault.\n\ndef load_config(path = None # Path to read json config into cache from\n               ):\n    config = benedict()\n    if path:\n        config = benedict(path.read_text(), format=\"json\")\n    try:\n        _cli([\"config\", \"set\", \"extension.use_dynamic_install=yes_without_prompt\"])\n        config = benedict(_cli([\"keyvault\", \"secret\", \"show\", \n                                \"--vault-name\", cache[\"vault_name\"], \n                                \"--name\", f\"squconfig-{cache['tenant_id']}\"]).value, format=\"json\")\n    except subprocess.CalledProcessError:\n        cache.delete(\"logged_in\") # clear the logged in state\n    config.standardize()\n    return config\n\ndef login(refresh: bool=False # Force relogin\n         ):\n    if \"/\" in os.environ.get(\"SQU_CONFIG\", \"\"):\n        cache[\"vault_name\"], cache[\"tenant_id\"] = os.environ[\"SQU_CONFIG\"].split(\"/\")\n    tenant = cache.get(\"tenant_id\")\n    try:\n        _cli([\"account\", \"show\"])\n        if tenant:\n            tenant_visible = len(_cli([\"account\", \"list\"]).search(tenant)) &gt; 0\n            assert tenant_visible &gt; 0\n        cache.set(\"logged_in\", True, 60 * 60 * 3) # cache login state for 3 hrs\n    except:\n        cache.delete(\"logged_in\")\n    while not cache.get(\"logged_in\"):\n        logger.info(\"Cache doesn't look logged in, attempting login\")\n        try:\n            # See if we can login with a managed identity in under 5 secs and see the configured tenant\n            subprocess.run([\"timeout\", \"5\", sys.executable, \"-m\", \"azure.cli\", \"login\", \"--identity\", \"-o\", \"none\", \"--allow-no-subscriptions\"], check=True)\n            if tenant:\n                tenant_visible = len(_cli([\"account\", \"list\"]).search(tenant)) &gt; 0\n                assert tenant_visible &gt; 0\n        except:\n            # If managed identity unavailable, fall back on a manual login\n            if tenant:\n                tenant_scope = [\"--tenant\", tenant]\n            else:\n                tenant_scope = []\n            _cli([\"login\", *tenant_scope, \"--use-device-code\", \"--allow-no-subscriptions\", \"-o\", \"none\"], capture_output=False)\n        # Finally, validate the login once more, and set the login state\n        try:\n            _cli([\"account\", \"show\"])\n            cache.set(\"logged_in\", True, 60 * 60 * 3) # cache login state for 3 hrs\n        except subprocess.CalledProcessError:\n            cache.delete(\"logged_in\")\n    logger.info(\"Cache state is logged in\")\n    if cache.get(\"vault_name\"): # Always reload config on any login call\n        logger.info(\"Loading config from keyvault\")\n        cache[\"config\"] = load_config() # Config lasts forever, don't expire\n\n\nsource\n\nlogin\n\n login (refresh:bool=False)\n\n\n\n\n\nType\nDefault\nDetails\n\n\n\n\nrefresh\nbool\nFalse\nForce relogin\n\n\n\n\nsource\n\n\nload_config\n\n load_config (path=None)\n\n\n\n\n\nType\nDefault\nDetails\n\n\n\n\npath\nNoneType\nNone\nPath to read json config into cache from\n\n\n\n\n\nHow to login\nThe login function will be called automatically if the azcli function defined below is used and the cache has no login timestamp, otherwise it can be called manually as well to refresh the keyvault config items with load_config (this directly loads a keyvault secret into the cache based on the SQU_CONFIG environment variable).\n\nlogin()\ncache[\"config\"].keys()\n\n\ndef azcli(basecmd: list[str]):\n    if not cache.get(\"logged_in\"):\n        login()\n    return _cli(basecmd)\n\n\nsource\n\n\nazcli\n\n azcli (basecmd:list[str])"
  },
  {
    "objectID": "core.html#datalake-path",
    "href": "core.html#datalake-path",
    "title": "core",
    "section": "Datalake Path",
    "text": "Datalake Path\nThe datalake_path function below, returns a UPath pathlib style object pointing to a configured datalake location in the cache.\n\ncache['config']['datalake_container']\n\n\n@memoize_stampede(cache, expire=60 * 60 * 24)\ndef datalake_path(expiry_days: int=3, # Number of days until the SAS token expires\n                  permissions: str=\"racwdlt\" # Permissions to grant on the SAS token\n                    ):\n    if not cache.get(\"logged_in\"): # Have to login to grab keyvault config\n        login()\n    expiry = pandas.Timestamp(\"now\") + pandas.Timedelta(days=expiry_days)\n    account = cache[\"config\"][\"datalake_account\"].split(\".\")[0] # Grab the account name, not the full FQDN\n    container = cache['config']['datalake_container']\n    sas = azcli([\"storage\", \"container\", \"generate-sas\", \"--auth-mode\", \"login\", \"--as-user\",\n                 \"--account-name\", account, \"--name\", container, \"--permissions\", permissions, \"--expiry\", str(expiry.date())])\n    return UPath(f\"az://{container}\", account_name=account, sas_token=sas)\n\n\nsource\n\ndatalake_path\n\n datalake_path (expiry_days:int=3, permissions:str='racwdlt')\n\n\n\n\n\nType\nDefault\nDetails\n\n\n\n\nexpiry_days\nint\n3\nNumber of days until the SAS token expires\n\n\npermissions\nstr\nracwdlt\nPermissions to grant on the SAS token\n\n\n\n\npath = datalake_path()\nprint(\"\\n\".join([str(p) for p in path.ls()]))"
  },
  {
    "objectID": "index.html",
    "href": "index.html",
    "title": "SIEM Query Utils",
    "section": "",
    "text": "pip install nbdev_squ"
  },
  {
    "objectID": "index.html#install",
    "href": "index.html#install",
    "title": "SIEM Query Utils",
    "section": "",
    "text": "pip install nbdev_squ"
  },
  {
    "objectID": "index.html#how-to-use",
    "href": "index.html#how-to-use",
    "title": "SIEM Query Utils",
    "section": "How to use",
    "text": "How to use\nBefore using, config needs to be loaded into squ.core.cache, which can be done automatically from json in a keyvault by setting the env var SQU_CONFIG to \"keyvault/tenantid\".\nexport SQU_CONFIG=\"{{ keyvault }}/{{ tenantid }}\"\n\nfrom nbdev_squ import api, clients\nimport io, pandas\n\n# Load workspace info from datalake blob storage\ndf = api.list_workspaces(fmt=\"df\"); print(df.shape)\n\n# Load workspace info from introspection of azure graph\ndf = api.list_securityinsights(); print(df.shape)\n\n# Kusto query to Sentinel workspaces via Azure Lighthouse\ndf = api.query_all(\"SecurityIncident | take 20\", fmt=\"df\"); print(df.shape)\n\n# Kusto queries to Sentinel workspaces via Azure Lighthouse (batches up to 100 queries at a time)\ndf = api.query_all([\"SecurityAlert | take 20\" for a in range(10)]); print(df.shape)\n\n# Kusto query to ADX\n#df = api.adxtable2df(api.adx_query(\"kusto query | take 20\"))\n\n# General azure cli cmd\napi.azcli([\"config\", \"set\", \"extension.use_dynamic_install=yes_without_prompt\"])\nprint(len(api.azcli([\"account\", \"list\"])))\n\n# Various pre-configured api clients\n\n# RunZero\n#response = clients.runzero.get(\"/export/org/assets.csv\", params={\"search\": \"has_public:t AND alive:t AND (protocol:rdp OR protocol:vnc OR protocol:teamviewer OR protocol:telnet OR protocol:ftp)\"})\n#runzero_assets = pandas.read_csv(io.StringIO(response.text))\n\n# Jira\n#issues = clients.jira.jql(\"updated &gt; -1d\")[\"issues\"]\n\n# AbuseIPDB\n#clients.abuseipdb.check_ip(\"1.1.1.1\")\n\n\nbadips_df = api.query_all(\"\"\"\nSecurityIncident\n| where Classification == \"TruePositive\"\n| mv-expand AlertIds\n| project tostring(AlertIds)\n| join SecurityAlert on $left.AlertIds == $right.SystemAlertId\n| mv-expand todynamic(Entities)\n| project Entities.Address\n| where isnotempty(Entities_Address)\n| distinct tostring(Entities_Address)\n\"\"\", timespan=pandas.Timedelta(\"45d\"))\n\n\ndf = api.query_all(\"find where ClientIP startswith '172.16.' | evaluate bag_unpack(pack_) | take 40000\")\n\n\ndf = api.query_all(\"\"\"union withsource=\"_table\" *\n| extend _ingestion_time_bin = bin(ingestion_time(), 1h)\n| summarize take_any(*) by _table, _ingestion_time_bin\n| project pack=pack_all(true)\"\"\")\n\n\nimport json\npandas.DataFrame(list(df[\"pack\"].apply(json.loads)))"
  }
]